"""
Завдання:
Створити код для читання і передобробки зображення

Підкроки:
* Створити файл data_preprocessor.py в якому зберігатиметься механізм передобробки зображень перед АІ обробкою за допомогою opencv (посилання нижче)
* Створити файл, в якому буде відбуватися читання документу .pdf документу у вигляді зображень
* main.py - для запуску функціоналу програми, яку необхідно створити
* main.py матиме вигляд CLI, детальніше про створення CLI нижче. Можна для цього використовувати інші комфортні Вам інструменти, а не те що надано в посиланні нижче.
* CLI прийматиме як аргумент назву .pdf файлу, який необхідно обробити
* Візуалізувати зображення сторінки з документи до і після обробки (можна як і за допомогою opencv, так і інші інструменти як matplot, plotly і тд)

"""


